run/test/system/air/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*boundary
{
    airInlet
    {
        inGroups        (coupleGroup);
    }
}*/

U
{
    internalField   uniform (0 0 0);

    boundaryField
    {
        ".*"
        {
            type            fixedValue;
            value           uniform (0 0 0);
        }
        airInlet
        {
            type            fixedValue;
            value           uniform (1.0 0 0);
        }
        airOutlet
        {
            type            zeroGradient;
        }
    }
}

T
{
    internalField   uniform 1000;

    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
        }

        airInlet
        {
            type            fixedValue;
            value           uniform 1000;
        }
        airOutlet
        {
            type            zeroGradient;
        }

        "air_to_.*"
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            value           uniform 1000;
        }
    }
}

epsilon
{
    internalField   uniform 0.01;

    boundaryField
    {
        ".*"
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }

        airInlet
        {
            type            fixedValue;
            value           uniform 0.01;
        }
        airOutlet
        {
            type            inletOutlet;
            inletValue      uniform 0.01;
            value           uniform 0.01;
        }
    }
}

k
{
    internalField   uniform 0.1;

    boundaryField
    {
        ".*"
        {
            type            kqRWallFunction;
            value           uniform 0.1;
        }

        airInlet
        {
            type            fixedValue;
            value           uniform 0.1;
        }
        airOutlet
        {
            type            inletOutlet;
            inletValue      uniform 0.1;
            value           uniform 0.1;
        }
    }
}

p_rgh
{
    internalField   uniform 101325;

    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
        }

        airOutlet
        {
            type            fixedValue;
            value           uniform 101325;
        }
        
        "air_to_.*"
        {
            type	    fixedFluxPressure;
            value	    uniform 0;
        }
    }
}

p
{
    internalField   uniform 101325;

    boundaryField
    {
        ".*"
        {
            type            calculated;
            value           uniform 101325;
        }

        airOutlet
        {
            type            calculated;
            value           uniform 101325;
        }
    }
}

O2
{
    internalField   uniform 0.233;

    boundaryField
    {
        ".*"
        {
	    type            zeroGradient;
        }

        airInlet
        {
            type            fixedValue;
            value           $internalField;
        }
        
        air_to_electrolyte
        {
            type            outletInlet;
            value           uniform 0;
            outletValue	    $internalField;
        }
    }
}

N2
{
    internalField   uniform 0.767;

    boundaryField
    {
        ".*"
        {
	    type            zeroGradient;
        }

        airInlet
        {
            type            fixedValue;
            value           $internalField;
        }
        
    }
}
// ************************************************************************* //
