run/test/system/fuel/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Anode
    {
        name    anodeCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 0 5.299e-3) (50.0e-3 4.0e-3 6.299e-3);
    }
    {
        name    anode;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     anodeCellSet;
    } 
    
);


// ************************************************************************* //
